src/test/resources/wiremock/__files/getProductCodeList-request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns1:getProductCodeList xmlns:ns1="urn:GizaAPI"><ticket><session>16319-00016306-00009951-00000000-3062</session><deadline xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><localTime>2023-10-06T12:00:55</localTime><shopName>ShoppingMall</shopName><actionsLimit xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ticketsLimit xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><comment>Welcome in RAC (RedBay Apps Center)</comment></ticket></ns1:getProductCodeList></soap:Body></soap:Envelope>